---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.RebarFailures.RebarShapeFailureCustomError
source: html/68d73a3e-8c67-ea9b-eaeb-2a30ff472e48.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RebarFailures.RebarShapeFailureCustomError Property

'[ErrorMessage]'

## Syntax (C#)
```csharp
public static FailureDefinitionId RebarShapeFailureCustomError { get; }
```